Autodesk.Revit.UI.ThinLinesOptions.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.UI.ThinLinesOptions.AreThinLinesEnabled
A static property defining if the 'Thin Lines' setting is on or off in current Revit Application Session.
Remarks:
If user started multiple Revit sessions, and the 'Thin Lines' setting might be different in each session.
Revit.ini file stores the lastest setting no matter what the Revit session is. The setting will be writen to Revit.ini if user set the value.
Since:
2015 Subscription Update

Autodesk.Revit.UI.ThinLinesOptions
A utility class containing setting related to the Thin Lines option which affects the display in the UI.
Since:
2015 Subscription Update